; domain
(define (domain blocks)
  (:requirements :strips :equality :disjunctive-preconditions :derived-predicates :negative-preconditions :conditional-effects :existential-preconditions :typing)

  (:types
    robot block - object
  )

  (:predicates 
    (on ?block1 - block ?block2 - block)
    (ontable ?block - block)
    (clear ?block - block)
    (KBquery_fullHands ?robot - robot)
    (holding ?robot - robot ?block - block)
  )

  (:action pick-up
    :parameters (?robot - robot ?block - block)
    :precondition (and 
      (clear ?block) 
      (ontable ?block) 
      (not (KBquery_fullHands ?robot))
    )
    :effect
      (and 
        (not (ontable ?block))
        (not (clear ?block))
        (holding ?robot ?block)
      )
  )

  (:action put-down
    :parameters (?robot - robot ?block - block)
    :precondition (holding ?robot ?block)
    :effect
      (and 
        (not (holding ?robot ?block))
        (clear ?block)
        (ontable ?block)
      )
  )

  (:action stack
    :parameters (?robot - robot ?block1 - block ?block2 - block)
    :precondition (and 
      (holding ?robot ?block1) 
      (clear ?block2)
      )
    :effect
      (and 
        (not (holding ?robot ?block1))
        (not (clear ?block2))
        (clear ?block1)
        (on ?block1 ?block2)
      )
  )

  (:action unstack
    :parameters (?robot - robot ?block1 - block ?block2 - block)
    :precondition (and 
      (on ?block1 ?block2) 
      (clear ?block1) 
      (not (KBquery_fullHands ?robot))
    )
    :effect
      (and 
        (holding ?robot ?block1)
        (clear ?block2)
        (not (clear ?block1))
        (not (on ?block2 ?block1))
      )
  )
)

; problem
(define (problem BLOCKS-6-1)
(:domain BLOCKS)
(:objects B E A C D F - block pr2 - robot)
(:INIT (CLEAR A) (CLEAR B) (CLEAR E) (CLEAR C) (CLEAR D) (ONTABLE F)
 (ONTABLE B) (ONTABLE E) (ONTABLE C) (ONTABLE D) (ON A F))
(:goal (AND (ON E F) (ON F C) (ON C B) (ON B A) (ON A D)))
)

; plan
1. (pick-up pr2 e)
   deleted: (ontable e) (clear e)
   added: (holding pr2 e)
   goals met: 0 of 5
2. (unstack pr2 a f)
   deleted: (clear a)
   added: (holding pr2 a) (clear f)
   goals met: 0 of 5
3. (stack pr2 a d)
   deleted: (holding pr2 a) (clear d)
   added: (clear a) (on a d)
   goals met: 1 of 5
4. (pick-up pr2 b)
   deleted: (ontable b) (clear b)
   added: (holding pr2 b)
   goals met: 1 of 5
5. (stack pr2 b a)
   deleted: (holding pr2 b) (clear a)
   added: (clear b) (on b a)
   goals met: 2 of 5
6. (pick-up pr2 c)
   deleted: (ontable c) (clear c)
   added: (holding pr2 c)
   goals met: 2 of 5
7. (stack pr2 c b)
   deleted: (holding pr2 c) (clear b)
   added: (clear c) (on c b)
   goals met: 3 of 5
8. (pick-up pr2 f)
   deleted: (ontable f) (clear f)
   added: (holding pr2 f)
   goals met: 3 of 5
9. (stack pr2 f c)
   deleted: (holding pr2 f) (clear c)
   added: (clear f) (on f c)
   goals met: 4 of 5
10. (stack pr2 e f)
   deleted: (holding pr2 e) (clear f)
   added: (clear e) (on e f)
   goals met: 5 of 5
